# 1.	Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
n=str(input('Введите трехзначное число: '))
print ('Сумма трех цифр:', int(n[0])+int(n[1])+int(n[2]))
print ('Произведение трех цифр:', int(n[0])*int(n[1])*int(n[2]))
