# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

n=int(input('Введите номер буквы в английском алфавите от 1 до 25 '))
print('это буква', chr(96+n))

